; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid_4room2_fpl_s4_seed1_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18
    shape0 shape1 shape2 shape3
    key0 key1 key2 key3
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18)
    (shape shape0) (shape shape1) (shape shape2) (shape shape3)
    (key key0) (key key1) (key key2) (key key3)
    ; Open/locked cells
    (open p0) (open p1) (open p3) (open p4) (open p5) (open p6) (open p7) (open p8) (open p11) (open p12) (open p13) (open p14) (open p15) (open p16) (open p17) (open p18)
    (locked p2) (locked p9) (locked p10)
    ; Connected cells
    (conn p0 p1)
    (conn p0 p5)
    (conn p1 p0)
    (conn p1 p2)
    (conn p1 p6)
    (conn p2 p1)
    (conn p2 p3)
    (conn p3 p2)
    (conn p3 p4)
    (conn p3 p7)
    (conn p4 p3)
    (conn p4 p8)
    (conn p5 p0)
    (conn p5 p6)
    (conn p5 p9)
    (conn p6 p5)
    (conn p6 p1)
    (conn p7 p3)
    (conn p7 p8)
    (conn p7 p10)
    (conn p8 p7)
    (conn p8 p4)
    (conn p9 p5)
    (conn p9 p11)
    (conn p10 p7)
    (conn p10 p13)
    (conn p11 p9)
    (conn p11 p12)
    (conn p11 p15)
    (conn p12 p11)
    (conn p12 p16)
    (conn p13 p10)
    (conn p13 p14)
    (conn p13 p17)
    (conn p14 p13)
    (conn p14 p18)
    (conn p15 p11)
    (conn p15 p16)
    (conn p16 p15)
    (conn p16 p12)
    (conn p17 p13)
    (conn p17 p18)
    (conn p18 p17)
    (conn p18 p14)
    ; Lock and key shapes
    (lock-shape p9 shape0)
    (lock-shape p2 shape3)
    (lock-shape p10 shape3)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    (key-shape key3 shape3)
    ; Key placement
    (at key0 p17)
    (at key1 p8)
    (at key2 p9)
    (at key3 p4)
    ; Robot placement
    (at-robot p8)
    (arm-empty)
  )
  (:goal (at-robot p16))
)

; plan
1. (move p8 p4)
   deleted: (at-robot p8)
   added: (at-robot p4)
   goals met: 0 of 1
2. (pickup p4 key3)
   deleted: (at key3 p4) (arm-empty)
   added: (holding key3)
   goals met: 0 of 1
3. (move p4 p3)
   deleted: (at-robot p4)
   added: (at-robot p3)
   goals met: 0 of 1
4. (unlock p3 p2 key3 shape3)
   deleted: (locked p2)
   added: (open p2)
   goals met: 0 of 1
5. (move p3 p7)
   deleted: (at-robot p3)
   added: (at-robot p7)
   goals met: 0 of 1
6. (unlock p7 p10 key3 shape3)
   deleted: (locked p10)
   added: (open p10)
   goals met: 0 of 1
7. (move p7 p10)
   deleted: (at-robot p7)
   added: (at-robot p10)
   goals met: 0 of 1
8. (move p10 p13)
   deleted: (at-robot p10)
   added: (at-robot p13)
   goals met: 0 of 1
9. (move p13 p17)
   deleted: (at-robot p13)
   added: (at-robot p17)
   goals met: 0 of 1
10. (pickup-and-loose p17 key0 key3)
   deleted: (holding key3) (at key0 p17)
   added: (holding key0) (at key3 p17)
   goals met: 0 of 1
11. (move p17 p13)
   deleted: (at-robot p17)
   added: (at-robot p13)
   goals met: 0 of 1
12. (move p13 p10)
   deleted: (at-robot p13)
   added: (at-robot p10)
   goals met: 0 of 1
13. (move p10 p7)
   deleted: (at-robot p10)
   added: (at-robot p7)
   goals met: 0 of 1
14. (move p7 p3)
   deleted: (at-robot p7)
   added: (at-robot p3)
   goals met: 0 of 1
15. (move p3 p2)
   deleted: (at-robot p3)
   added: (at-robot p2)
   goals met: 0 of 1
16. (move p2 p1)
   deleted: (at-robot p2)
   added: (at-robot p1)
   goals met: 0 of 1
17. (move p1 p6)
   deleted: (at-robot p1)
   added: (at-robot p6)
   goals met: 0 of 1
18. (move p6 p5)
   deleted: (at-robot p6)
   added: (at-robot p5)
   goals met: 0 of 1
19. (unlock p5 p9 key0 shape0)
   deleted: (locked p9)
   added: (open p9)
   goals met: 0 of 1
20. (move p5 p9)
   deleted: (at-robot p5)
   added: (at-robot p9)
   goals met: 0 of 1
21. (move p9 p11)
   deleted: (at-robot p9)
   added: (at-robot p11)
   goals met: 0 of 1
22. (move p11 p15)
   deleted: (at-robot p11)
   added: (at-robot p15)
   goals met: 0 of 1
23. (move p15 p16)
   deleted: (at-robot p15)
   added: (at-robot p16)
   goals met: 1 of 1
